app/views/appllist/update_status.html.erb

<p>Find me in app/views/appllist/update_status.html.erb</p>
<% @jobapplication=Jobapplication.find(params[:jobapplication_id]) %>
---
SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 31]]