app/controllers/appllist_controller.rb

SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 31]]
UPDATE "jobapplications" SET "status" = ?, "updated_at" = ? WHERE "jobapplications"."id" = 31  [["status", "underView"], ["updated_at", "2014-09-27 00:12:20.767051"]]
---
  def update_status
    @jobapplication=Jobapplication.find(params[:jobapplication_id])
    logger.debug params[:update_status].to_s
    # logger.debug "aaaaaa"
    status=params[:update_status].to_s
    logger.debug status
    # status=status_id
    respond_to do |format|
      if @jobapplication.update(:status=>status)