app/controllers/jobapplications_controller.rb

  def index
    @jobapplications = Jobapplication.all
---
SELECT "jobapplications".* FROM "jobapplications"

  def create
    @user=current_user
    job=Job.find(session[:job_id])

    @jobapplication = @user.jobapplications.build(job:job)
    @jobapplication.name=jobapplication_params[:name]
    @jobapplication.phone=jobapplication_params[:phone]
    @jobapplication.email=jobapplication_params[:major]
    @jobapplication.coverletter=jobapplication_params[:coverletter]
    @jobapplication.status="pending"
    @jobapplication.job_name=job.name
    @jobapplication.email=current_user.email
    respond_to do |format|
      if @jobapplication.save(jobapplication_params)
---
INSERT INTO "jobapplications" ("created_at", "job_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-17 16:55:56.567676"], ["job_id", 1], ["status", "pending"], ["updated_at", "2014-09-17 16:55:56.567676"], ["user_id", 1]]

  def destroy
    @jobapplication.destroy
---
DELETE FROM "jobapplications" WHERE "jobapplications"."id" = ?  [["id", 1]]

    def set_jobapplication
      @jobapplication = Jobapplication.find(params[:id])
---
SELECT  "jobapplications".* FROM "jobapplications"  WHERE "jobapplications"."id" = ? LIMIT 1  [["id", 7]]